---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.WallFailures
source: html/22d82d7e-a7d6-c096-991c-728df0b2d61c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures

Failures about Wall.

## Syntax (C#)
```csharp
public static class WallFailures
```